Repository: laowantong/mocodo
Catalog: messages_*.po
Languages: fr

source: Missing cardinalities in leg "%(leg)s" of association "%(name)s".
fr: Cardinalités manquantes sur la patte « %(leg)s » de l'association « %(name)s ».

source: Missing minimum or maximum cardinality in leg "%(leg)s" of association "%(name)s".
fr: Cardinalité minimale ou maximale manquante sur la patte « %(leg)s » de l'association « %(name)s ».

source: Output file "%s" successfully generated.
fr: Fichier de sortie "%s" généré avec succès.

source: Problem with format %s.
fr: Problème avec le format %s.

source: Problem during MLD generation.
fr: Problème lors de la génération du MLD.

source: Unable to generate file "%s".
fr: Impossible de générer le fichier "%s".

source: Association "%(a)s" linked to an unknown entity "%(e)s".
fr: Association « %(a)s » liée à une entité inconnue « %(e)s ».

source: Mocodo does not work under Python %s. Please install Python 2.7 or 2.6 (or 2.5 + simplejson).
fr: Mocodo ne fonctionne pas sous Python %s. Veuillez le lancer avec Python 2.7 ou 2.6 (ou 2.5 + simplejson).

source: Generated by Mocodo %s on %s
fr: Généré par Mocodo %s le %s

source: lines += u'\n\n<desc>Generated by Mocodo %s on %s</desc>'
fr: lines += u'\n\n<desc>Généré par Mocodo %s le %s</desc>'

source: Unable to read "%(file)s" with any of the following encodings: "%(encodings)s".
fr: Impossible de lire "%(file)s" dans aucun des encodages suivants : "%(encodings)s".

source: The MCD is empty.
fr: Le MCD est vide.

source: safePrint(u'Output file "%(root)s.svg" successfully generated.')
fr: safePrint(u'Fichier de sortie "%(root)s.svg" généré avec succès.')
