Repository: laowantong/mocodo
Catalog: mocodo/resources/res/messages_*.po
Languages: fr

source: Failed to calculate a planar layout.
fr: Impossible de calculer une mise en page planaire sur la grille impartie.

source: The file "{input}" doesn't exist.
fr: Le fichier « {input} » n'existe pas.

source: Untitled
fr: Sans titre

source: Layout calculation time exceeded.
fr: Dépassement du temps maximum alloué pour le calcul de la mise en page.

source: Unknown specialization "{name}".
fr: Spécialisation inconnue « {name} ».

source: Missing cardinalities on leg "{leg}" of association "{name}".
fr: Cardinalités manquantes sur la patte « {leg} » de l'association « {name} ».

source: Missing leg in association "{name}".
fr: Patte manquante dans association « {name} ».

source: Syntax error in inheritance "{inheritance}".
fr: Erreur dans la syntaxe de l'héritage « {inheritance} ».

source: Only cardinalities "/0N" or "/1N" are permitted to start with a "/" character.
fr: Seules les cardinalités 0N ou 1N peuvent être préfixée d'une barre oblique.

source: To become a cluster, association "{name}" must have at least one cardinality "0N" or "1N" (without "/").
fr: Pour devenir une pseudo-entité (ou agrégation), l'association « {name} » doit avoir au moins une cardinalité 0N ou 1N (sans barre oblique).

source: To become a cluster, association "{name}"'s cardinalities must all be "0N", "1N", "/0N" or "/1N".
fr: Pour devenir une pseudo-entité (ou agrégation), l'association « {name} » ne peut avoir d'autres cardinalités que 0N, 1N, /ON ou /1N.

source: Output file "{filename}" successfully generated.
fr: Fichier de sortie « {filename} » généré avec succès.

source: Generated by Mocodo {version} on {date}
fr: Généré par Mocodo {version} ({date}).

source: Unable to read "{filename}" with any of the following encodings: "{encodings}".
fr: Impossible de lire « {filename} » dans aucun des encodages suivants : \"{encodings}\".

source: Problem with "{name}" file "{path}".
fr: Problème lors du chargement de « {name} » au bout du chemin « {path} ».

source: Problem with template {template}.
fr: Problème avec le gabarit « {template} ».

source: Problem during the generation of the relational schema.
fr: Problème lors de la génération du schéma relationnel.

source: Unable to generate file "{filename}"!
fr: Impossible de générer le fichier « {filename} ».

source: Attribute "{attribute}" in entity "{entity_1}" references an unknown entity "{entity_2}".
fr: L'attribut « {attribute} » de l'entité « {entity_1} » fait référence à une entité « {entity_2} » inconnue.

source: Attribute "{attribute_1}" in entity "{entity_1}" references an unknown attribute "{attribute_2}" in entity "{entity_2}".
fr: L'attribute « {attribute_1} » de l'entité « {entity_1} » fait référence à un attribut « {attribute_2} » inconnu dans l'entité « {entity_2} ».

source: The clause "{clause}" starts with a colon.
fr: La clause « {clause} » commence par un deux-points.

source: Duplicate association "{name}". If you want to make two associations appear with the same name, you must suffix it with a number.
fr: Association « {name} » dupliquée. Si vous souhaitez faire apparaître deux associations sous le même nom, vous devez suffixer celui-ci avec un nombre.

source: Duplicate entity "{name}". If you want to make two entities appear with the same name, you must suffix it with a number.
fr: Entité « {name} » dupliquée. Si vous souhaitez faire apparaître deux entités sous le même nom, vous devez suffixer celui-ci avec un nombre.

source: "{clause}" does not constitute a valid declaration of an entity or association.
fr: « {clause} » ne constitue pas une déclaration d'entité ou d'association valide.

source: One entity and one association share the same name "{name}".
fr: Une entité et une association ont le même nom « {name} ».

source: The ERD is empty.
fr: Le MCD est vide.

source: Association "{association}" linked to another association "{entity}"!
fr: Association « {association} » liée à une autre association « {entity} ».

source: Association "{association}" linked to an unknown entity "{entity}"!
fr: Association « {association} » liée à une entité inconnue « {entity} ».

source: PNG and PDF generation requires cairosvg to be installed
fr: Générer un PNG ou un PDF requiert une installation fonctionnelle de CairoSVG.

source: Obfuscation failed. Not enough substitution words in "{filename}". You may decrease the `obfuscation_min_distance` option values.
fr: Échec de l'obfuscation. Il n'y a pas assez de mots de substitution dans « {filename} ». Vous devriez diminuer la valeur de l'option `obfuscation_min_distance`.

source: Reciprocal relative identification around {association}.
fr: Identification relative réciproque autour de « {association} ».

source: A weak entity (here, {entity}) cannot be strengthened by itself.
fr: Une entité faible (ici, « {entity} ») ne peut être renforcée par elle-même.

source: Cycle of weak entities in {entities}.
fr: Cycle d'entités faibles dans {entities}.

source: Totality (/T\ or /XT\) is mandatory for "=>" inheritance of parent {name}.
fr: La totalité (/T\ or /XT\) est requise pour définir l'héritage « => » sur l'entité-mère « {name} ».
