Repository: laowantong/mocodo
Catalog: mocodo/resources/i18n/messages_*.po
Languages: fr

source: Unknown argument "{k}" for option --select.
fr: Argument « {k} » inconnu pour l'option --select.

source: The file "{path}" is missing.
fr: Le fichier « {path} » est manquant.

source: The file "{path}" is not a valid JSON file.
fr: Le fichier « {path} » n'est pas un fichier JSON valide.

source: The file "{path}" could not be read: {err}
fr: Le fichier « {path} » n'a pas pu être lu : {err}

source: No third-party rendering service for extension "{extension}". You may want to add one in "{path}".
fr: Aucun service de rendu tiers pour l'extension « {extension} ». Vous pouvez en ajouter un dans « {path} ».

source: The HTTP status code {code} was returned by: {url}
fr: Le code HTTP {code} a été retourné par : {url}

source: - Leg "{b1} — {b2}" overlaps "{b3}".
fr: - La patte « {b1} — {b2} » chevauche « {b3} ».

source: - Legs "{b1} — {b2}" and "{b3} — {b4}" overlap.
fr: - Les pattes « {b1} — {b2} » et « {b3} — {b4} » se chevauchent.

source: Bad layout of boxes: {details} To fix the problem, reorder and/or skip lines in the source text, either manually, or with the option -t arrange (chocolate bar under Mocodo online).
fr: Mauvaise disposition des boîtes : {details} Pour corriger cela, réordonnez et/ou sautez des lignes dans le texte-source, soit à la main, soit à l'aide de l'option -t arrange (tablette de chocolat sous Mocodo online).

source: OPTIONS ON MOCODO ITSELF
fr: OPTIONS SUR MOCODO LUI-MÊME

source: INPUT/OUTPUT
fr: ENTRÉE/SORTIE

source: ASPECT OF THE GRAPHICAL OUTPUT
fr: ASPECT DE LA SORTIE GRAPHIQUE

source: NAME: Mocodo - An Entity-Relation Diagram Generator. DESCRIPTION: Mocodo is an open-source tool for designing and teaching relational databases. It takes as an input a textual description of both entities and associations of an entity-relationship diagram (ERD). It outputs a vectorial drawing in SVG and a relational schema in various formats (SQL, LaTeX, Markdown, etc.). NOTE: Each one of the following values is: - explicitely specified by the user as a command line option; - otherwise, retrieved from a file located at --params_path; - otherwise, retrieved from a file named 'params.json' in the input directory; - otherwise, calculated from a default value, possibly dependant of your system.
fr: NOM : Mocodo - Un générateur de diagrammes entité-association. DESCRIPTION : Mocodo est un outil libre destiné à l'enseignement des bases de données relationnelles. Il prend en entrée une description textuelle des entités et associations d'un diagramme entité-association (MCD). Il produit en sortie un dessin vectoriel en SVG et un schéma relationnel dans divers formats (SQL, LaTeX, Markdown, etc.). NOTE : Chacune des valeurs suivantes est : - spécifiée explicitement par l'utilisateur comme option de ligne de commande ; - sinon, récupérée depuis un fichier de chemin --params_path ; - sinon, récupérée depuis un fichier nommé « params.json » dans le répertoire d'entrée ; - sinon, calculée à partir d'une valeur par défaut, éventuellement dépendante de votre système.

source: SEE ALSO: Online version https://mocodo.net Source code https://github.com/laowantong/mocodo Documentation https://rawgit.com/laowantong/mocodo/master/doc/fr_refman.html Cheat sheet for -t https://github.com/laowantong/mocodo/blob/master/doc/fr_cheat_sheet.md LICENSE: MIT CONTACT: Author Aristide Grange Address Université de Lorraine Laboratoire LCOMS - UFR MIM 3 rue Augustin Fresnel 57070 METZ Technopôle France Mail <author.full.name>@univ-lorraine.fr
fr: VOIR AUSSI : Version en ligne https://mocodo.net Code source https://github.com/laowantong/mocodo Documentation https://rawgit.com/laowantong/mocodo/master/doc/fr_refman.html Aide-mémoire pour -t https://github.com/laowantong/mocodo/blob/master/doc/fr_cheat_sheet.md LICENCE : MIT CONTACT : Auteur Aristide Grange Adresse Université de Lorraine Laboratoire LCOMS - UFR MIM 3 rue Augustin Fresnel 57070 METZ Technopôle France Courriel <prénom.nom>@univ-lorraine.fr

source: rearrange the layout with either a Branch & Bound or a Genetic Algorithm
fr: réarrange la disposition, soit par Branch & Bound, soit avec un algorithme génétique

source: rewrite the given elements in ASCII
fr: réécrit les éléments donnés en ASCII

source: dump the abstract syntax tree of the source text (for debugging purposes)
fr: crée l'arbre de syntaxe abstraite du texte source (pour le débogage)

source: rewrite the given elements in camelCase
fr: réécrit les éléments donnés en camelCase

source: rewrite the given elements by capitalizing the first letter of each word
fr: réécrit les éléments donnés en capitalisant la première lettre de chaque mot

source: rewrite the given elements in lowercase, but more aggressively than 'lower'
fr: réécrit les éléments donnés en minuscules, mais plus agressivement que « lower »

source: convert the conceptual model into a Chen's ERD
fr: convertit le modèle conceptuel dans la notation de Chen

source: try to infer types, entities, CIFs or DF arrows from the existing elements
fr: essaie d'inférer les types, entités, CIFs ou flèches de DF à partir des éléments existants

source: convert the conceptual model into a crow's foot ERD
fr: convertit le modèle conceptuel dans la notation crow's foot

source: collect all the attributes of the MCD in a table
fr: extrait tous les attributs du MCD dans une table

source: suppress the given elements whenever possible
fr: supprime les éléments donnés quand c'est possible

source: move any (1,1) association attribute to the appropriate entity
fr: déplace tout attribut d'association (1,1) vers l'entité appropriée

source: replace all element names by a numbered generic label
fr: remplace tous les noms d'éléments par un libellé générique numéroté

source: rewrite the source text as is
fr: réécrit le texte source tel quel

source: decompose any n-ary (*,N) associations into n binary ones
fr: décompose toute association n-aire (*,N) en n associations binaires

source: try to fix common errors in the given elements
fr: essaie de corriger les erreurs courantes dans les éléments donnés

source: apply a vertical, horizontal or diagonal symmetry to the diagram
fr: applique au diagramme une symétrie verticale, horizontale ou diagonale

source: add random entities and associations (default: 10 new associations)
fr: ajoute des entités et associations aléatoires (par défaut : 10 nouvelles associations)

source: rewrite the given elements in lowercase
fr: réécrit les éléments donnés en minuscules

source: prefix the given elements with the given string
fr: préfixe les éléments donnés avec la chaîne donnée

source: keep the stucture, but replace the given elements with random ones whenever possible
fr: garde la structure, mais randomise les éléments donnés quand c'est possible

source: convert the conceptual model into a relational schema with the given template path
fr: convertit le modèle conceptuel en schéma relationnel avec le gabarit donné

source: rewrite the given elements by applying the given 'search/repl' pattern
fr: réécrit les éléments donnés en appliquant le motif « recherche/remplacement » donné

source: rewrite the given elements in snake_case
fr: réécrit les éléments donnés en snake_case

source: decompose any n-ary (*,1) associations into n-1 binary ones
fr: décompose toute association n-aire (*,1) en n-1 associations binaires

source: suffix the given elements with the given string
fr: suffixe les éléments donnés avec la chaîne donnée

source: rewrite the given elements by swapping the case of each letter
fr: réécrit les éléments donnés en inversant la casse de chaque lettre

source: The template '{stem}' doesn't have a help message in language of code '{language}' or 'en'.
fr: Le gabarit « {stem} » n'a pas de message d'aide dans la langue de code « {language} » ou « en ».

source: rewrite the given elements in Title Case
fr: réécrit les éléments donnés en mettant la première lettre de chaque mot en majuscule

source: convert the conceptual model into a UML class diagram
fr: convertit le modèle conceptuel en diagramme de classes UML

source: encode the MCD into a URL for Mocodo online
fr: encode le MCD dans une URL pour Mocodo online

source: rewrite the given elements in UPPERCASE
fr: réécrit les éléments donnés en majuscules

source: The transformation '{subopt}' is not among the possible ones: {valid}.
fr: La transformation « {subopt} » n'est pas parmi celles qui sont possibles : {valid}.

source: rewrite the given elements by keeping only a given slice
fr: réécrit les éléments donnés en n'en gardant qu'une tranche donnée

source: truncate the given elements to the given length (default: {n})
fr: tronque les éléments donnés à la longueur donnée (par défaut : {n})

source: override the automatic localization of the messages with the given language code (e.g., 'fr', 'en', ...)
fr: force la localisation des messages avec le code de langue donné (par exemple, « fr », « en », ...)

source: the path of the parameter file. If omitted, use 'params.json' in the input directory. If non existent, use default parameters.
fr: le chemin du fichier de paramètres. S'il est omis, utilise « params.json » dans le répertoire d'entrée. S'il n'existe pas, utilise les paramètres par défaut.

source: the path of the input file. By default, the output files will be generated in the same directory
fr: le chemin du fichier d'entrée. Par défaut, les fichiers de sortie seront générés dans le même répertoire

source: show this help message, then exit
fr: affiche ce message d'aide, puis termine

source: display the version number, then exit
fr: affiche le numéro de version, puis termine

source: recreate a pristine version of the files 'sandbox.mcd' and 'params.json' in the input directory, then exit
fr: recrée une version vierge des fichiers « sandbox.mcd » et « params.json » dans le répertoire d'entrée, puis termine

source: the directory of the output files
fr: le répertoire des fichiers de sortie

source: one or several encodings to be tried successively when reading the input file
fr: un ou plusieurs encodages à essayer successivement lors de la lecture du fichier d'entrée

source: generate a PNG or a PDF version of the SVG output (requires CairoSVG)
fr: génère une version PNG ou PDF de la sortie SVG (requiert CairoSVG)

source: display the contents of the parameter file, then exit
fr: affiche le contenu du fichier de paramètres, puis termine

source: reuse the geometry file of the previous execution
fr: réutilise le fichier de géométrie de l'exécution précédente

source: discriminate between multiple SVG of the same interactive diagram
fr: ajoute un discriminateur à un SVG interactif

source: under Jupyter Notebook, explicitely state the categories of results to display
fr: sous Jupyter Notebook, spécifie explicitement les catégories de résultats à afficher

source: use an external web-service to further convert the conversion results into the given graphical formats
fr: utilise un service web externe pour convertir les résultats de la conversion dans les formats graphiques donnés

source: backward compatibility alias for '-t' (with no arguments). Same as '-t markdown' but, under Jupyter Notebook, does not prevent the rendering of the conceptual diagram in the cell output
fr: alias de compatibilité ascendante pour « -t » (sans arguments). Équivalent à « -t markdown » mais, sous Jupyter Notebook, n'empêche pas le rendu du diagramme conceptuel dans la sortie de la cellule

source: make a new version of the MCD by applying sequentially the given rewriting operations, and/or convert it into the given formats or languages. Under Jupyter Notebook, '-T' respectively replaces the current cell by the textual result, or copies it into the clipboard (pip3 install pyperclip)
fr: crée une nouvelle version du MCD en appliquant séquentiellement les opérations de réécriture données, et/ou le convertit dans les formats ou langages donnés. Sous Jupyter Notebook, « -T » remplace respectivement la cellule courante par le résultat textuel, ou le copie dans le presse-papier (pip3 install pyperclip)

source: initial value for the random number generator
fr: valeur initiale pour le générateur de nombres aléatoires

source: Untitled
fr: MCD

source: name of the model, used at various places (file system, database, etc.)
fr: nom du modèle, utilisé à divers endroits (système de fichiers, base de données, etc.)

source: the acronym to be circled in a functional dependency
fr: l'acronyme à entourer dans une dépendance fonctionnelle

source: format string for minimal and maximal cardinalities
fr: chaîne de formatage pour les cardinalités minimales et maximales

source: format string for foreign keys in relational diagram
fr: chaîne de formatage pour les clés étrangères dans le diagramme relationnel

source: string for relative cardinalities
fr: chaîne pour les cardinalités relatives

source: flex straight legs whose cardinalities may collide
fr: incurve les pattes rectilignes dont les cardinalités peuvent se chevaucher

source: the color palette to use when generating the drawing. Name (without extension) of a file located in the directory 'colors', or path to a personal file
fr: la palette de couleurs à utiliser lors de la génération du dessin. Nom (sans extension) d'un fichier situé dans le répertoire « colors », ou chemin vers un fichier personnel

source: specification of the fonts, dimensions, etc. Name (without extension) of a file located in the directory 'shapes', or path to a personal file
fr: spécification des polices, dimensions, etc. Nom (sans extension) d'un fichier situé dans le répertoire « shapes », ou chemin vers un fichier personnel

source: scale the diagram by the given factor
fr: applique au diagramme le facteur de mise à l'échelle donné

source: scale all calculated text widths by the given factor
fr: applique à tous les textes calculés le facteur de mise à l'échelle donné

source: raise an error when horizontal or vertical legs overlap
fr: lève une erreur quand des pattes horizontales ou verticales se chevauchent

source: forbid the use of identifiers in associations (according to the Merise standard)
fr: interdit l'utilisation d'identifiants dans les associations (conformément au standard Merise)

source: set the visibility and the contents of the lateral gutters
fr: définit la visibilité et le contenu des gouttières latérales

source: The association "{name}" cannot have an identifier.
fr: L'association « {name} » ne peut pas avoir d'identifiant.

source: The association "{name}" should have at least 3 legs to become a cluster.
fr: L'association « {name} » devrait avoir au moins 3 pattes pour devenir un agrégat.

source: An association named "{df_label}" must have at least one leg with a maximal cardinality of 1.
fr: Une association nommée « {df_label} » doit avoir au moins une patte avec une cardinalité maximale de 1.

source: Output file "{filename}" successfully generated.
fr: Fichier de sortie « {filename} » généré avec succès.

source: Source file "{filename}" successfully updated.
fr: Fichier source « {filename} » mis à jour avec succès.

source: Unable to read "{filename}" with any of the following encodings: "{encodings}".
fr: Impossible de lire « {filename} » dans aucun des encodages suivants : \"{encodings}\".

source: The file "{input}" doesn't exist.
fr: Le fichier « {input} » n'existe pas.

source: Problem with "{name}" file "{path}".
fr: Problème lors du chargement de « {name} » au bout du chemin « {path} ».

source: {complete, disjoint}
fr: {complet, disjoint}

source: {incomplete, disjoint}
fr: {incomplet, disjoint}

source: {complete, overlapping}
fr: {complet, non disjoint}

source: {incomplete, overlapping}
fr: {incomplet, non disjoint}

source: Circular inheritance in template "{name}.yaml" of "{folder}.
fr: Héritage circulaire dans le gabarit « {name}.yaml » de « {folder} ».

source: Template "{name}.yaml" not found in "{folder}".
fr: Gabarit « {name}.yaml » introuvable dans « {folder} ».

source: Unable to decode template "{name}.yaml" of "{folder}".
fr: Impossible de décoder le gabarit « {name}.yaml » de « {folder} ».

source: Template "{name}.yaml" of "{folder}" contains a YAML object as value of key "{key}".
fr: Le gabarit « {name}.yaml » de « {folder} » contient un objet YAML comme valeur de la clé « {key} ».

source: Template "{name}.yaml" of "{folder}" contains a YAML array as value of key "{key}" which does not contain only YAML objects.
fr: Le gabarit « {name}.yaml » de « {folder} » contient un tableau YAML comme valeur de la clé « {key} » qui ne contient pas uniquement des objets YAML.

source: Template "{name}.yaml" of "{folder}" contains a YAML array as value of key "{key}" which does not contain only objects having an "order" key.
fr: Le gabarit « {name}.yaml » de « {folder} » contient un tableau YAML comme valeur de la clé « {key} » qui ne contient pas uniquement des objets ayant une clé « order ».

source: Template "{name}.yaml" of "{folder}" contains a YAML array as value of key "{key}" where the "order" key is not associated to a number.
fr: Le gabarit « {name}.yaml » de « {folder} » contient un tableau YAML comme valeur de la clé « {key} » où la clé « order » n'est pas associée à un nombre.

source: Template "{name}.yaml" of "{folder}" contains a YAML array as value of key "{key}" where the "order" keys are not sorted in ascending order.
fr: Le gabarit « {name}.yaml » de « {folder} » contient un tableau YAML comme valeur de la clé « {key} » où les clés « order » ne sont pas triées par ordre croissant.

source: Cannot compile the regular expression "{regex}" or the remplacement string "{replace}" in a relation template producing "*{stem_suffix}.{extension}" files.
fr: Impossible de compiler l'expression régulière « {regex} » ou la chaîne de remplacement « {replace} » dans un gabarit de relation produisant des fichiers « *{stem_suffix}.{extension} ».

source: Reciprocal relative identification around {association}.
fr: Identification relative réciproque autour de {association}.

source: A weak entity (here, {entity}) cannot be strengthened by itself.
fr: Une entité faible (ici, {entity}) ne peut pas être renforcée par elle-même.

source: Cycle of weak entities in {entities}.
fr: Cycle d'entités faibles dans {entities}.

source: Totality (/T\ or /XT\) is mandatory for "=>" inheritance of parent "{name}".
fr: La totalité (/T\ ou /XT\) est obligatoire pour l'héritage « => » de l'entité-mère « {name} ».

source: is {name}
fr: est {name}

source: Attribute "{attribute}" in entity "{entity_1}" references an unknown entity "{entity_2}".
fr: L'attribut « {attribute} » de l'entité « {entity_1} » fait référence à une entité « {entity_2} » inconnue.

source: Attribute "{attribute_1}" in entity "{entity_1}" references an unknown attribute "{attribute_2}" in entity "{entity_2}".
fr: L'attribute « {attribute_1} » de l'entité « {entity_1} » fait référence à un attribut « {attribute_2} » inconnu dans l'entité « {entity_2} ».

source: Duplicate association "{name}". If you want to make two associations appear with the same name, you must suffix it with a number.
fr: Association « {name} » dupliquée. Si vous souhaitez faire apparaître deux associations sous le même nom, vous devez suffixer celui-ci avec un nombre.

source: Duplicate entity "{name}". If you want to make two entities appear with the same name, you must suffix it with a number.
fr: Entité « {name} » dupliquée. Si vous souhaitez faire apparaître deux entités sous le même nom, vous devez suffixer celui-ci avec un nombre.

source: One entity and one association share the same name "{name}".
fr: Une entité et une association ont le même nom « {name} ».

source: The ERD "{title}" is empty.
fr: Le MCD « {title} » est vide.

source: Association "{association}" linked to another association "{entity}"!
fr: Association « {association} » liée à une autre association « {entity} ».

source: Association "{association}" linked to an unknown entity "{entity}"!
fr: Association « {association} » liée à une entité inconnue « {entity} ».

source: Inheritance "{inheritance}" linked to an association "{entity}"!
fr: L'héritage « {inheritance} » est lié à une association « {entity} ».

source: Inheritance "{inheritance}" linked to an unknown entity "{entity}"!
fr: L'héritage « {inheritance} » est lié à une entité inconnue « {entity} ».

source: Constraint "{constraint}" linked to an unknown entity or association "{box}"!
fr: Une contrainte « {constraint} » est liée à une entité ou association inconnue « {box} ».

source: Constraint "{constraint}" aligned with an unknown entity or association "{box}"!
fr: Une contrainte « {constraint} » est alignée avec une entité ou association inconnue « {box} ».

source: The weak entity "{entity}" should have a discriminator.
fr: L'entité faible « {entity} » devrait avoir un discriminateur.

source: Unable to reuse the geometry file "{filename}".
fr: Impossible de réutiliser le fichier de géométrie « {filename} ».

source: Unable to save geometry file "{filename}".
fr: Impossible de sauvegarder le fichier de géométrie « {filename} ».

source: PNG and PDF generation requires cairosvg to be installed
fr: Générer un PNG ou un PDF requiert une installation fonctionnelle de CairoSVG.

source: Invalid sub-argument: "{subsubopt}={subsubarg}".
fr: Sous-argument invalide : « {subsubopt}={subsubarg} ».

source: Invalid sub-sub-option: "{subsubopt}".
fr: Sous-sous-option invalide : « {subsubopt} ».

source: Unknown "{opt}" sub-option: "{subopt}".
fr: Sous-option « {opt} » inconnue : « {subopt} ».

source: ENTITY
fr: ENTITÉ

source: attr
fr: at

source: role
fr: rôle

source: Binary
fr: Binaire

source: Quaternary
fr: Quaternaire

source: Reflexive
fr: Réflexive

source: Ternary
fr: Ternaire

source: Entity
fr: Entité

source: Weak Entity
fr: Entité faible

source: Cannot find a suitable combination of card schemes and arities.
fr: Impossible de trouver une combinaison adéquate de schémas de cardinalités et d'arités.

source: Layout calculation time exceeded.
fr: Temps de calcul du plongement dépassé.

source: Failed to calculate a non-constrained planar layout.
fr: Impossible de calculer un plongement planaire.

source: Failed to calculate a planar layout satisfying the given constraint.
fr: Impossible de calculer un plongement planaire satisfaisant la contrainte donnée.

source: Obfuscation failed. Not enough substitution words in "{filename}".
fr: L'obfuscation a échoué. Pas assez de mots de substitution dans « {filename} ».

source: Operation "{op_name}" cannot be applied to "{pre_token}".
fr: L'opération « {op_name} » ne peut pas être appliquée à « {pre_token} ».

source: Parsing error: {e}
fr: Erreur d'analyse syntaxique : {e}

source: {pin}"{v}" is not a valid line beginning.
fr: {pin}« {v} » n'est pas un début de ligne valide.

source: {pin}Malformed box name.
fr: {pin}Nom de boîte mal formé.

source: {pin}A valid box name starting a line must be followed by a colon or a comma.
fr: {pin}Un nom de boîte valide en début de ligne doit être suivi d'un deux-points ou d'une virgule.

source: {pin}Illegal comma after inheritance.
fr: {pin}Virgule illégale après un héritage.

source: {pin}Malformed cardinalities.
fr: {pin}Cardinalités mal formées.

source: {pin}An inheritance name must be "", "X", "T" or "XT".
fr: {pin}Un nom d'héritage doit être « », « X », « T » ou « XT ».

source: {pin}Only two coords are allowed.
fr: {pin}Seulement deux coordonnées sont autorisées.

source: {pin}An association leg cannot be empty.
fr: {pin}Une patte d'association ne peut pas être vide.

source: {pin}Expected a number or a box name.
fr: {pin}Un nombre ou un nom de boîte est attendu.

source: {pin}Only a box name is possible here.
fr: {pin}Seul un nom de boîte est possible ici.

source: {pin}Unclosed square bracket.
fr: {pin}Crochet fermant manquant.
