Repository: laowantong/mocodo
Catalog: mocodo/resources/i18n/messages_*.po
Languages: fr

source: {pin}A constraint name cannot contain more than three characters.
fr: {pin}Un nom de contrainte ne peut contenir plus de trois caractères.

source: {pin}Expected a box name or a constraint leg.
fr: {pin}Un nom de boîte ou une patte de contrainte est attendu.

source: {pin}Illegal character after a constraint name.
fr: {pin}Caractère illégal après un nom de contrainte.

source: {pin}A parent name must be followed by an inheritance arrow among "<=", "<-", "->", "=>".
fr: {pin}Un nom de parent doit être suivi d'une flèche d'héritage parmi « <= », « <- », « -> », « => ».

source: {pin}Please change the old foreign key syntax ("->") by the new one (">").
fr: {pin}Veuillez changer l'ancienne syntaxe de clé étrangère (« -> ») par la nouvelle (« > »).

source: {pin}The constraint targets must be comma-separated.
fr: {pin}Les cibles de la contrainte doivent être séparées par des virgules.

source: {pin}An attribute label cannot start with "{v[1]!r}".
fr: {pin}Un nom d'attribut ne peut pas commencer par « {v[1]!r} ».

source: {pin}An attribute label cannot contain "{v}".
fr: {pin}Un nom d'attribut ne peut pas contenir « {v} ».

source: {pin}An attribute starting with "#" must contain two ">".
fr: {pin}Vous semblez essayer de spécifier une clé étrangère. Au niveau du MCD (modèle conceptuel de données), ce sont les associations qui répondent à ce besoin. Les clés étrangères n'apparaîtront qu'après passage au relationnel, dans le MLD (modèle logique de données). À ce niveau, elles devront suivre la syntaxe : « #clé étrangère > table d'origine > clé primaire ».

source: {pin}Expected an entity name.
fr: {pin}Un nom d'entité est attendu.

source: {pin}A box name cannot contain "{v}".
fr: {pin}Un nom de boîte ne peut pas contenir « {v} ».

source: {pin}Expected a comma.
fr: {pin}Une virgule est attendue.

source: {pin}Malformed number.
fr: {pin}Nombre mal formé.

source: {pin}More than two coordinates.
fr: {pin}Plus de deux coordonnées.

source: {pin}An attribute label cannot have more than one optionality marker.
fr: {pin}Un nom d'attribut ne peut pas avoir plus d'un marqueur d'optionalité.

source: {pin}Token "{t}" encountered. Expected tokens: {expected}.
fr: {pin}Token « {t} » rencontré. Tokens attendus : {expected}.
